СуточноМесячныйГрафик/src/Documents/ПланВыполнения/ПланВыполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланВыполнения</name>
  <registerRecords>AccumulationRegister.СуточныйГрафик</registerRecords>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>ШифрПроекта</name>
      <type>
        <types>CatalogRef.ШифрыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокальнаяСмета</name>
      <type>
        <types>CatalogRef.ЛокальныеСметы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСМР</name>
      <type>
        <types>CatalogRef.СправочникСМР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдИзм</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъёмВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СуточноМесячныйГрафик/src/AccumulationRegisters/СуточныйГрафик/СуточныйГрафик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СуточныйГрафик</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПланОбъёмВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактОбъёмВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.СправочникПодрядчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПроекта</name>
    <type>
      <types>CatalogRef.ШифрыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛокальнаяСмета</name>
    <type>
      <types>CatalogRef.ЛокальныеСметы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СМР</name>
    <type>
      <types>CatalogRef.СправочникСМР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.ЕдИзм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СуточноМесячныйГрафик/src/Documents/ПланВыполнения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СуточныйГрафик 
	Движения.СуточныйГрафик.Записывать = Истина;
	Движения.СуточныйГрафик.Очистить();
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		// Проверка на КонецПериода и НачалоПериода
		Если ТекСтрокаТабличнаяЧасть1.КонецПериода<ТекСтрокаТабличнаяЧасть1.НачалоПериода Тогда
			Сообщить("Ошибка в периодах: дата окончания меньще даты начала");
			
		КонецЕсли;
		КоличествоДнейВыполнения = 1+(НачалоДня(ТекСтрокаТабличнаяЧасть1.КонецПериода)-НачалоДня(ТекСтрокаТабличнаяЧасть1.НачалоПериода))/(86400);//24*60*60
		СуточноеВыполнение = ТекСтрокаТабличнаяЧасть1.ОбъёмВыполнения/КоличествоДнейВыполнения;
		//Для ТекДеньВыполнения=ТекСтрокаТабличнаяЧасть1.НачалоПериода По ТекСтрокаТабличнаяЧасть1.КонецПериода Цикл
		ТекДеньВыполнения = ТекСтрокаТабличнаяЧасть1.НачалоПериода;
		Для НомерДня=1 По КоличествоДнейВыполнения Цикл
			Движение = Движения.СуточныйГрафик.Добавить();
			Движение.Период = ТекДеньВыполнения;
			Движение.ШифрПроекта = ТекСтрокаТабличнаяЧасть1.ШифрПроекта;
			Движение.ЛокальнаяСмета = ТекСтрокаТабличнаяЧасть1.ЛокальнаяСмета;
			Движение.СМР = ТекСтрокаТабличнаяЧасть1.НаименованиеСМР;
			Движение.ЕдИзм = ТекСтрокаТабличнаяЧасть1.ЕдиницаИзмерения;
			Движение.ДатаВыполнения = ТекДеньВыполнения;
			Движение.ПланОбъёмВыполнения = СуточноеВыполнение;
			//
			ТекДеньВыполнения = КонецДня(ТекДеньВыполнения)+1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
